IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-STRING PIC X(15) VALUE 'ABCDACDADEAAAFF'.
PROCEDURE DIVISION.
     RETURN INT-INDEX-KEY FROM EMP-LNAME-NDX
       FIRST CURRENCY
       KEY INTO NDX-LNAME-SYM-KEY.
STOP RUN.
