IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-STRING PIC X(15) VALUE 'ABCDACDADEAAAFF'.
PROCEDURE DIVISION.
      RETURN sort-work
           AT END MOVE HIGH-VALUE to loop-flag
      END-RETURN
STOP RUN.
